jaxb/src/test/resources/lexs-4.0-samples/SN-samples/Notify-MatchSubscriptionNotification.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
              xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <env:Header>
        <wsa:MessageID>http://www.cjis.fbi.gov/N-DEx/NotificationService/308</wsa:MessageID>
        <wsa:To>http://www.cjis.fbi.gov/OneDOJ/017</wsa:To>
        <wsa:Action>http://docs.oasis-open.org/wsn/bw-2/NotificationConsumer/Notify</wsa:Action>
    </env:Header>
    <env:Body>
        <wsnt:Notify xmlns:ulex="http://ulex.gov/ulex/2.0"
                   xmlns:ulexsr="http://ulex.gov/searchretrieve/2.0"
                   xmlns:ulexsn="http://ulex.gov/subscribenotify/2.0"
                   xmlns:ulexcodes="http://ulex.gov/codes/2.0"
                   xmlns:ulexlib="http://ulex.gov/library/2.0"
                   xmlns:j="http://niem.gov/niem/domains/jxdm/4.1"
                   xmlns:nc="http://niem.gov/niem/niem-core/2.0"
                   xmlns:em="http://niem.gov/niem/domains/emergencyManagement/2.0"
                   xmlns:im="http://niem.gov/niem/domains/immigration/2.0"
                   xmlns:scr="http://niem.gov/niem/domains/screening/2.0"
                   xmlns:s="http://niem.gov/niem/structures/2.0"
                   xmlns:lexs="http://lexs.gov/lexs/4.0"
                   xmlns:lexsdigest="http://lexs.gov/digest/4.0"
                   xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                   xsi:schemaLocation="http://docs.oasis-open.org/wsn/b-2 ../../xsd/oasis-open.org/wsn/b-2/b-2.xsd">

         <wsnt:NotificationMessage>
            <wsnt:SubscriptionReference>
               <wsa:Address>http://www.cjis.fbi.gov/N-DEx/NotificationService/12345</wsa:Address>
            </wsnt:SubscriptionReference>
            <wsnt:Message>
               <ulexsn:MatchSubscriptionNotification>
                  <ulexsn:SNMessageMetadata>
                    <ulex:ULEXFrameworkVersionText>2.0</ulex:ULEXFrameworkVersionText>
                    <ulex:ULEXImplementation>
                        <ulex:ULEXImplementationVersionText>4.0</ulex:ULEXImplementationVersionText>
                        <ulex:ULEXImplementationName>LEXS</ulex:ULEXImplementationName>
                    </ulex:ULEXImplementation>
                    <ulex:MessageDateTime>2006-12-17T09:30:47.0Z</ulex:MessageDateTime>
                    <wsa:MessageID>http://www.cjis.fbi.gov/N-DEx/NotificationService/308</wsa:MessageID>
                    <wsa:RelatesTo>http://www.cjis.fbi.gov/OneDOJ/413</wsa:RelatesTo>
                    <!--=======================  Message Origin  =======================-->
                    <ulex:MessageOriginMetadata>
                        <lexs:SystemIdentifier>
                            <!-- ORI and OriginatingAgencyID are optional here and were not include in sample  -->
                            <nc:OrganizationName>Hypothetical Organization E</nc:OrganizationName>
                            <lexs:SystemID>SysE</lexs:SystemID>
                        </lexs:SystemIdentifier>
                        <lexs:SystemContact>
                            <nc:PersonGivenName>Jim</nc:PersonGivenName>
                            <nc:PersonSurName>West</nc:PersonSurName>
                            <nc:ContactTelephoneNumber>
                                <nc:FullTelephoneNumber>
                                    <nc:TelephoneNumberFullID>770-555-1212</nc:TelephoneNumberFullID>
                                </nc:FullTelephoneNumber>
                            </nc:ContactTelephoneNumber>
                        </lexs:SystemContact>
                    </ulex:MessageOriginMetadata>
                    <!--====================== Message Destination ==========================-->
                    <lexs:MessageDestinationIdentifier>
                        <!-- ORI and OriginatingAgencyID are optional here and were not include in sample  -->
                        <nc:OrganizationName>Hypothetical Organization F</nc:OrganizationName>
                        <lexs:SystemID>SysF</lexs:SystemID>
                    </lexs:MessageDestinationIdentifier>
                  </ulexsn:SNMessageMetadata>
                  <!--=======================  Response Metadata  =======================-->
                <ulex:ResponseMetadata>
                    <ulex:ResultCode>Success</ulex:ResultCode>
                  </ulex:ResponseMetadata>
                  <!--=======================  Search Response Metadata  =======================-->
                <ulex:SearchResponseMetadata>
                    <ulex:MaxItemMatchesRequestedNumeric>10</ulex:MaxItemMatchesRequestedNumeric>
                    <ulex:NumberItemMatchesText>2</ulex:NumberItemMatchesText>
                    <ulex:ServerLimitIndicator>false</ulex:ServerLimitIndicator>
                  </ulex:SearchResponseMetadata>
                  <!--=========================================================-->
                                        <!--=======================  Package #1  =======================-->
                                        <!--=========================================================-->
                <ulex:SearchResultPackage>
                    <ulex:PackageMetadata>
                        <ulex:DataItemID>12345678</ulex:DataItemID>
                        <!-- DataItemContact is the person(s) who can be contacted about the data item  -->
                                                        <!-- DataItemContact is optional, and there can be more than one -->
                        <lexs:DataItemContact>
                            <!-- PersonName may be a split out name, or both a split out name and a full name.  Last name is required. -->
                            <nc:PersonSurName>Jackson</nc:PersonSurName>
                            <nc:PersonFullName>David Jackson</nc:PersonFullName>
                            <!-- Contact telephone number is required, other kinds of numbers optional -->
                            <nc:ContactTelephoneNumber>
                                <nc:FullTelephoneNumber>
                                    <!-- Full phone number listed here, although the phone number could be split into parts -->
                                    <nc:TelephoneNumberFullID>333-444-5555 x6</nc:TelephoneNumberFullID>
                                </nc:FullTelephoneNumber>
                            </nc:ContactTelephoneNumber>
                            <lexs:DataContactDomainAttribute>
                                <ulex:AttributeName>ContactRole</ulex:AttributeName>
                                <ulex:AttributeValueText>Arresting Officer</ulex:AttributeValueText>
                                <ulex:DomainName>GBI</ulex:DomainName>
                            </lexs:DataContactDomainAttribute>
                        </lexs:DataItemContact>
                        <ulex:DataItemDate>2006-12-13</ulex:DataItemDate>
                        <!-- DataItemReferenceID may be the same as the DataItemID, or may be a more human-readable version of DataItemID -->
                        <ulex:DataItemULEXImplementation>
                            <ulex:ULEXImplementationVersionText>4.0</ulex:ULEXImplementationVersionText>
                            <ulex:ULEXImplementationName>LEXS</ulex:ULEXImplementationName>
                        </ulex:DataItemULEXImplementation>
                        <ulex:DataItemReferenceID>1912345678</ulex:DataItemReferenceID>
                        <lexs:DataItemStatusText>Closed_Case</lexs:DataItemStatusText>
                        <!--=======================  Data Owner Metadata  =======================-->
                        <ulex:DataOwnerMetadata>
                            <lexs:DataOwnerIdentifier>
                                <lexs:OriginatingAgencyID>AA1234567</lexs:OriginatingAgencyID>
                                <nc:OrganizationName>Hypothetical Agency A</nc:OrganizationName>
                                <lexs:SystemID>SysA</lexs:SystemID>
                            </lexs:DataOwnerIdentifier>
                            <lexs:DataOwnerContact>
                                <nc:PersonGivenName>Will</nc:PersonGivenName>
                                <nc:PersonSurName>Jones</nc:PersonSurName>
                                <nc:ContactTelephoneNumber>
                                    <nc:FullTelephoneNumber>
                                        <nc:TelephoneNumberFullID>111-222-3333</nc:TelephoneNumberFullID>
                                    </nc:FullTelephoneNumber>
                                </nc:ContactTelephoneNumber>
                                <lexs:DataContactDomainAttribute>
                                    <ulex:AttributeName>ContactRole</ulex:AttributeName>
                                    <ulex:AttributeValueText>RMS Manager</ulex:AttributeValueText>
                                    <ulex:DomainName>GBI</ulex:DomainName>
                                </lexs:DataContactDomainAttribute>
                            </lexs:DataOwnerContact>
                        </ulex:DataOwnerMetadata>
                        <lexs:DisseminationCriteria>
                            <lexs:DisseminationCriteriaDomainName>Test</lexs:DisseminationCriteriaDomainName>
                            <lexs:DisseminationCriteriaText>white</lexs:DisseminationCriteriaText>
                        </lexs:DisseminationCriteria>
                    </ulex:PackageMetadata>
                    <!--=======================  Digest  =======================-->
                    <lexs:Digest>
                        <lexsdigest:EntityPerson>
                            <lexsdigest:Person s:id="Sub1">
                                <nc:PersonName>
                                    <nc:PersonGivenName>Tommy</nc:PersonGivenName>
                                    <nc:PersonSurName>Jones</nc:PersonSurName>
                                </nc:PersonName>
                                <nc:PersonSSNIdentification xsi:nil="false">
                                    <nc:IdentificationID>333-44-5555</nc:IdentificationID>
                                </nc:PersonSSNIdentification>
                            </lexsdigest:Person>
                        </lexsdigest:EntityPerson>
                    </lexs:Digest>
                    <!--=======================  Data Submitter Metadata  =======================-->
                    <ulex:DataSubmitterMetadata>
                        <lexs:SystemIdentifier>
                            <nc:OrganizationName>Hypothetical Organization C</nc:OrganizationName>
                            <lexs:SystemID>SysC</lexs:SystemID>
                        </lexs:SystemIdentifier>
                        <lexs:SystemContact>
                            <nc:PersonGivenName>Michael</nc:PersonGivenName>
                            <nc:PersonSurName>Park</nc:PersonSurName>
                            <!-- Contact telephone number is required, other kinds of numbers optional -->
                            <nc:ContactTelephoneNumber>
                                <!-- Phone number listed here split into parts, although the full phone number field could be used instead or in addition to the parts -->
                                <nc:NANPTelephoneNumber>
                                    <nc:TelephoneAreaCodeID>202</nc:TelephoneAreaCodeID>
                                    <nc:TelephoneExchangeID>555</nc:TelephoneExchangeID>
                                    <nc:TelephoneLineID>1212</nc:TelephoneLineID>
                                </nc:NANPTelephoneNumber>
                            </nc:ContactTelephoneNumber>
                            <lexs:DataContactDomainAttribute>
                                <ulex:AttributeName>ContactRole</ulex:AttributeName>
                                <ulex:AttributeValueText>Data Center Operations</ulex:AttributeValueText>
                                <ulex:DomainName>GBI</ulex:DomainName>
                            </lexs:DataContactDomainAttribute>
                        </lexs:SystemContact>
                    </ulex:DataSubmitterMetadata>
                    <ulex:MatchDetails>
                        <ulex:StructuredQueryMatchScorePercent>1</ulex:StructuredQueryMatchScorePercent>
                    </ulex:MatchDetails>
                  </ulex:SearchResultPackage>
                  <!--=========================================================-->
                                        <!--=======================  Package #2  =======================-->
                                        <!--=========================================================-->
                <ulex:SearchResultPackage>
                    <ulex:PackageMetadata>
                        <ulex:DataItemID>12345679</ulex:DataItemID>
                        <!-- DataItemContact is the person(s) who can be contacted about the data item  -->
                                                        <!-- DataItemContact is optional, and there can be more than one -->
                        <lexs:DataItemContact>
                            <!-- PersonName may be a split out name, or both a split out name and a full name.  Last name is required. -->
                            <nc:PersonSurName>Jackson</nc:PersonSurName>
                            <nc:PersonFullName>David Jackson</nc:PersonFullName>
                            <!-- Contact telephone number is required, other kinds of numbers optional -->
                            <nc:ContactTelephoneNumber>
                                <nc:FullTelephoneNumber>
                                    <!-- Full phone number listed here, although the phone number could be split into parts -->
                                    <nc:TelephoneNumberFullID>333-444-5555 x6</nc:TelephoneNumberFullID>
                                </nc:FullTelephoneNumber>
                            </nc:ContactTelephoneNumber>
                        </lexs:DataItemContact>
                        <ulex:DataItemDate>2006-12-13</ulex:DataItemDate>
                        <!-- DataItemReferenceID may be the same as the DataItemID, or may be a more human-readable version of DataItemID -->
                        <ulex:DataItemReferenceID>1912345679</ulex:DataItemReferenceID>
                        <lexs:DataItemStatusText>Closed_Case</lexs:DataItemStatusText>
                        <!--=======================  Data Owner Metadata  =======================-->
                        <ulex:DataOwnerMetadata>
                            <lexs:DataOwnerIdentifier>
                                <lexs:OriginatingAgencyID>DD1234567</lexs:OriginatingAgencyID>
                                <nc:OrganizationName>Hypothetical Agency D</nc:OrganizationName>
                                <lexs:SystemID>SysD</lexs:SystemID>
                            </lexs:DataOwnerIdentifier>
                            <lexs:DataOwnerContact>
                                <nc:PersonGivenName>Will</nc:PersonGivenName>
                                <nc:PersonSurName>Dee</nc:PersonSurName>
                                <nc:ContactTelephoneNumber>
                                    <nc:FullTelephoneNumber>
                                        <nc:TelephoneNumberFullID>222-222-3333</nc:TelephoneNumberFullID>
                                    </nc:FullTelephoneNumber>
                                </nc:ContactTelephoneNumber>
                            </lexs:DataOwnerContact>
                        </ulex:DataOwnerMetadata>
                        <lexs:DisseminationCriteria>
                            <lexs:DisseminationCriteriaDomainName>Test</lexs:DisseminationCriteriaDomainName>
                            <lexs:DisseminationCriteriaText>white</lexs:DisseminationCriteriaText>
                        </lexs:DisseminationCriteria>
                    </ulex:PackageMetadata>
                    <!--=======================  Digest  =======================-->
                    <lexs:Digest>
                        <lexsdigest:EntityPerson s:id="ESub2">
                            <lexsdigest:Person s:id="Sub2">
                                <nc:PersonName>
                                    <nc:PersonGivenName>Tommy</nc:PersonGivenName>
                                    <nc:PersonMiddleName>Lee</nc:PersonMiddleName>
                                    <nc:PersonSurName>Jones</nc:PersonSurName>
                                </nc:PersonName>
                                <nc:PersonSSNIdentification xsi:nil="false">
                                    <nc:IdentificationID>034-78-6532</nc:IdentificationID>
                                </nc:PersonSSNIdentification>
                            </lexsdigest:Person>
                        </lexsdigest:EntityPerson>
                    </lexs:Digest>
                    <!--=======================  Package Attachment Link Mugshot  =======================-->
                    <ulex:AttachmentSummary ulexlib:id="PAttachment2">
                        <ulex:AttachmentDescriptionText>Mug shot for Tommy Lee Jones</ulex:AttachmentDescriptionText>
                        <ulex:AttachmentURI>http://www.gtri.org/LEXS/examples/TommyJonesMugshot1.jpg</ulex:AttachmentURI>
                        <ulex:AttachmentViewableIndicator>true</ulex:AttachmentViewableIndicator>
                    </ulex:AttachmentSummary>
                    <!--=======================  Associations  =======================-->
                    <ulex:Linkages>
                        <lexsdigest:PersonFacialImageConnection>
                            <ulexlib:AttachmentSummaryReference ulexlib:validatingObjectReference="PAttachment2"/>
                            <ulexlib:DigestObjectReference ulexlib:validatingObjectReference="Sub2"/>
                        </lexsdigest:PersonFacialImageConnection>
                    </ulex:Linkages>
                    <!--=======================  Data Submitter Metadata  =======================-->
                    <ulex:DataSubmitterMetadata>
                        <lexs:SystemIdentifier>
                            <lexs:OriginatingAgencyID>DD1234567</lexs:OriginatingAgencyID>
                            <nc:OrganizationName>Hypothetical Organization D</nc:OrganizationName>
                            <lexs:SystemID>SysD</lexs:SystemID>
                        </lexs:SystemIdentifier>
                        <lexs:SystemContact>
                            <nc:PersonGivenName>Michael</nc:PersonGivenName>
                            <nc:PersonSurName>Smith</nc:PersonSurName>
                            <!-- Contact telephone number is required, other kinds of numbers optional -->
                            <nc:ContactTelephoneNumber>
                                <!-- Phone number listed here split into parts, although the full phone number field could be used instead or in addition to the parts -->
                                <nc:NANPTelephoneNumber>
                                    <nc:TelephoneAreaCodeID>303</nc:TelephoneAreaCodeID>
                                    <nc:TelephoneExchangeID>555</nc:TelephoneExchangeID>
                                    <nc:TelephoneLineID>1212</nc:TelephoneLineID>
                                </nc:NANPTelephoneNumber>
                            </nc:ContactTelephoneNumber>
                        </lexs:SystemContact>
                    </ulex:DataSubmitterMetadata>
                  </ulex:SearchResultPackage>

               </ulexsn:MatchSubscriptionNotification>
            </wsnt:Message>
         </wsnt:NotificationMessage>
      </wsnt:Notify>
    </env:Body>
</env:Envelope>